Hi! My name's Guybrush Threepwood, and I want to be a pirate!
Er... I'm over this way.
THREEPWOOD. Guybrush THREEPWOOD.
Gosh, thanks! I'll do that! Bye, now. I'm off to seek my fortune.
(walks away, but suddenly stops)
Right. Thanks.
My name's Guybrush Threepwood. I'm new in town.
I don't know... I kind of like 'Guybrush.'
Well, what's YOUR name?
I want to be a pirate!
Where can I find the Governor?
Why not?
How's that?
I'd like to introduce myself... my name's Guybrush.
Who's this pirate that's bugging the Governor?
What's so scary about this LeChuck guy?
What happened then?
What happened to your eye?
Excuse me, but I'm looking for the dart board.
Where can I get a drink?
Aye, yourself.
Nice hat.
So, tell me about LOOM.
Geeze, what an obvious sales pitch.
Nice talking to you.
Woof.
Wuf, 'LeChuck?'
I want to be a fireman.
I mean to kill you all!
I want to be a pirate.
I can hold my breath for ten minutes!
Er... What three trials are those?
Tell me more about mastering the sword.
Tell me more about mastering the art of thievery.
Tell me more about treasure hunting.
Should I have a map or something?
You're a bunch of foul-smelling, grog-swilling pigs!
What's in that grog stuff, anyway?
I'll just be running along now.
No, but I once had a barber named Dominique.
No thanks. I don't have enough money.
Hey, nice rat!
Yes, I love rats!
That's amazing!
Do you guys know the sneaky-looking man on the opposite corner?
No, but I'll take one if you give me two pieces of eight.
Say, are you guys pirates?
What's in the keg?
I'm really interested in this pirating thing.
How come you're on this street corner and not on a ship, looting,
Maybe no one will miss just this one thing.
(How much for this keen-looking chicken?)
Why don't you want it? Is it jinxed with an ancient voodoo curse?
(My name is Guybrush Threepwood and I'm a mighty pirate.)
Lucky guess. Half the people I know are named Guybrush. 
Journey? What can you tell me about my journey?
Yeah!
What? See what?
Yikes!
Gross.
What kind of things? I hate surprises.
Yikes!
Hello? Anybody in here? HELLO???
Yeah, and bad things happen to people who sneak up on other people
I'm Guybrush Threepwood, and I'm a mighty pirate.
Threepwood! Guybrush Threepwood!
Boy, I feel much better knowing there's an officer of the law
Not to mention halitosis.
I could really use a breath mint.
(gives the money)
I think I'd just like to browse.
Who are you?
But why are you in jail, if you're innocent?
What flowers?
Can I get you anything?
So, how's the food in there?
What was so odd about the rump roast?
Sheriff Shinetop sure is a jerk, isn't he?
He IS filthy. And he smells bad too.
Sorry.
(interrupts) Why are you guys dressed up in those ridiculous
How much will you pay me?
OK, sounds good.
Er... no, I don't have a helmet. Will I need one?
Of course I have a helmet. What sort of idiot do you take me for?
(talks into the cannon)
(written--err, spoken--in upside-down words)
(Picks the sword and the shovel)
(Approaches the storekeeper)
About this sword...
How much is it?
I'll take it.
I'd like some rat repellent, please.
About this shovel...
How much is it?
I'll take it.
I think I'd just like to browse.
Look behind you! A mouse!
Stand aside, troll, I'm a mighty pirate.
I can out-insult anybody, you brainless clay doppelganger!
Oh, please, can't I pass?
How much is the toll?
A rubber chicken with a pulley in the middle?
My old moss-covered three-handled family credenza?
How much did you say the toll was?
(walks through the bridge)
Captain Smirk's Big Body Pirate Gym
I think I'll knock. It'd only be polite.
Um, could you please put out that cigar? It's not good for your
Uh... ...maybe I'll just leave instead.
Do you know where the Sword Master lives?
Can we step inside? It's a little chilly out here.
I said it's a little chilly out here!
Could you train me to be better than the Sword Master?
I do so have what it takes!
I do so!
I do so!
All I have is this dead chicken.
I figured you'd do it for free.
I've got 30 pieces of eight.
I do have this deadly-looking chicken.
OK, check it out.
(still swinging the sword)
Machine? Is this going to hurt?
Yikes!
You must be thinking of someone else, I am not a farmer.
How appropriate. You fight like a cow.
I can't help but feel like I've been ripped off. I'm sure you're
Nice night we're having, isn't it?
How do you guys talk so funny?
My name is Guybrush Threepwood. Prepare to die!
Ever notice how all these roads start to look the same?
My name is Guybrush Threepwood. Prepare to die!
I'm looking for the Sword Master of Mêlée Island™.
I don't think strolling through the forest picking flowers is very
I better just stay back here and eavesdrop.
Hi, I'm selling these fine leather jackets.
Yep, nailed right on the head... gee, you're smart.
Even BEFORE they smell your breath?
I wanted to make sure you'd feel comfortable with me.
You run THAT fast?
And I've got a little TIP for you. Get the POINT?
Too bad no one's ever heard of YOU at all.
He must have taught you everything you know.
I'm glad to hear you attended your family reunion.
I'm the deadliest scalawag what ever swung a sword!
I'll just be running along now.
On those helpless dogs?
Better leave this here.
It's a big, ugly, hairy yak wearing some wax lips.
I can't move it.
I can't move it.
I'll need this. I must be nuts!
(loud voice) Acck!
It's beautiful!
I can't open it. Uh, oh!
That should hold him for a while! If only I had a file I could get
There's a file in it!
I've got the file.
Phew! That was a close one. At least I got the idol.
Uh-oh.
Look, I can explain...
They're just sleeping!
The door was unlocked!
No, you've got it all wrong!
The pirate leaders told me to do it!
Gee...
Jeepers...
Grlpyt...
Bgglw! Mfrnkf? Dmnkly...
I'm going to go put this idol in my safe-deposit box.
Uh-oh.
I can't reach that from here.
Gee, I don't know how much longer I can hold my breath...
I guess I'll be needing a sword. This one will do.
Governor!
What are YOU doing here? Come to finish the job?
You came down here to rescue me? I didn't even think you liked me.
But I'm not one of your citizens... ...I'm just a drifter, a
Who would have known, or even cared, if
(walks away) Oh, Governor...
(comes closer) Oh, Elaine!
(comes closer) Love muffin! 
(comes closer) Honey pumpkin!
Kiss me!
What?
Why, are you ashamed of me?
Okay then, let's go to your place.
But...
I feel this sudden urge to complete the trials... ...quickly.
I'm the sneakiest footpad in these isles!
I'll just be running along now.
I'll take it. It'll make a swell gift.
I think I've been had! This is no map! It looks like... ...dancing
'The Legendary Lost Treasure of Mêlée Island™'
Here lies treasure of such unimaginable wealth... ...well, you'll
This shouldn't take too long.
Hey, I think I hit something!
What was that? I'm so confused.
What? By whom?
So where were you this whole time? Sleeping?
I'll go get a crew and a ship and go rescue her!
(takes the note) 
Attention, pirates of Mêlée: Your governor is alive and well and by
Hey! I'm back and I'm ready to know more about the future.
Yikes!
I really hate that flashing, it makes me see spots.
Must what?
What?
Yeah!
Spill it!
Great.
Don't worry, I'll watch out for LeChuck.
Did you know the Governor's been kidnapped?
Can I interest you in a dream vacation to Monkey Island™?
Where are all the pirates?
What can I do to save her?
Why should I do that?
Where can I get a ship?
Will you join me?
Get me a drink!
Right! I'm off! 
This stuff is eating right through the mug!
(pours the grog)
Well, actually, there is something... I'm looking for brave people
(turns around)
(turns around again) I can't believe I fell for that. Pretty good
I'm here to loot the Governor's mansion.
Reservations?!? For looting?
Why, yes I do have reservations.
Threepwood, Guybrush Threepwood.
No thanks, I've got a ship to catch.
I want to embarass you at swordfighting again.
I want us to make up and be friends.
The Governor's been KIDNAPPED!
(shows the note from LeChuck)
I'm getting a ship and a crew together to rescue her.
I'm a pirate, cannonball-head. Who are you?
I'm sorry. I didn't mean to call you cannonball-head.
I meant to call you chrome dome.
Excuse me, but the sign said there were restrooms in here?
What was your name again, cannonball-head? 
I'm sorry, I didn't mean to call you cannonball-head.
Ha ha ha.
Yes, please show me, Mr. Meat.
The Governor's been KIDNAPPED!
Oh really?
We could get a crew together and sail off after them.
What about me?
Hey, I'm serious.
Really.
Wait!
No, I just don't know what I'm supposed to do.
Oh, is that all?
Oh, come on, Meathook. You're a big, strong, good-looking guy with
Sure.
Just pack your stuff and meet me at the dock.
(walks out of the house) 
Wow, this is sounding better and better all the time.
Let me see the best ship you've got.
Money is no object!
All I have is this rubber chicken.
Actually, I was hoping to get one on credit.
Oh... no more than 174 pieces of eight.
On second thought, this may not be the ship for me.
Something not too expensive, but built to last.
Oh... no more than 174 pieces of eight.
On second thought, this may not be the ship for me.
That spiffy blue one by your office looks nice.
I really don't have that much to spend.
Chimps? There aren't any chimps in the Caribbean! 
Oh... no more than 174 pieces of eight.
On second thought, this may not be the ship for me.
Actually, I'd like to go think about it some more.
(receives the card)
A compass?
With your picture on it...
Right. (leaving)
I'm interested in procuring a note of credit.
Yes, of course I do.
I'm a grog-swilling, foul-smelling pirate.
I'm looking for the Sword Master of Mêlée Island™.
Maybe if you asked her again? Hmmm... I guess I could hike all the
Hmmm... There's nothing in here but this note.
Uh... could I see that red one again?
I got credit from the storekeeper. Will you take it?
Uh... could I see that Viking one again?
I got credit from the storekeeper. Will you take it?
Uh... how much do you want for yours?
Uh, could I see that cheap one again?
I got credit from the storekeeper. Will you take it?
Uh... right.
Well, what do you think it's worth?
Let's talk extras.
I think I can live without that particular piece of junk.
I think I can live without that particular piece of junk.
I think I can live without that particular piece of junk.
I think I can live without that particular piece of junk.
I think I can live without that particular piece of junk.
I think I can live without that particular piece of junk.
I think I can live without that particular piece of junk.
Enough about extras, already. 
Well, what do you think it's worth? 
I'd like to make you an offer. 
I'd like to pay 2000 pieces of eight.
I'd like to make you an offer.
How does 3000 pieces of eight sound?
I'd like to make you an offer.
Okay, okay. 4000 pieces of eight.
I'd like to make you an offer.
All right! 5000! But that's my final offer!
(gives the note)
(accepts the brochures)
Maybe I should have gotten that extended warranty after all.
Have you come to be on my crew?
Money?
How appropriate. You fight like a cow.
This isn't going to be as easy as I thought.
First of all... I'd like to say it's great to be working with such
(shows a paper) I made a list.
--sigh--
I'm doomed. 
It says: 
Hey guys, what's happening?
Is there anything I can do to get you guys to help me?
I'm going to give you mutineers five seconds to come to your
Keelhaul / Ke(e)l-hol
I hear the weather's pretty nice over by Monkey Island™.
Hmmmm.... I loved this stuff when I was a kid. I liked the way it
 Crunch Crunch Crunch Crunch GREAT! A toy prize inside.
This is no prize! It's a small key with a finely engraved monkey on
Man, that's heavy. Filled, no doubt, with gold and jewels. 
He look! A piece of paper. And some cinnamon sticks.
(walks away seeing the pot's making weird green smoke)
Fsspt. I feel awful.
Holy Monkey Bladders! It's Monkey Island™.
Hey look... ...we've made it to Monkey Island™.
"NOTICE OF PUBLIC MEETING"
The trail ends here.
Er, sorry.
It's printed on letterhead!
I got taken by a guy named Stan...
Are you some kind of a castaway?
Who are you talking to?
(looks at player) Um... sure.
Were you stranded?
Boy, it sure is HOT here.
"To the Monkey Island™ Cannibals:"
"Herman--"
He looks pretty bad...
I'm Guybrush. I'm here to rescue someone.
Er... That's not exactly what I meant. I sailed here in pursuit of
Um... Well, perhaps I could take you back, too... ...but I've got
What happened to your pants?
How did you get stranded here?
How come you didn't just go with the chimps?
You're the only one on the island?
Did you lend something to the cannibals?
Why don't you just give me the key to the Monkey Head?
Excuse me, I've got pressing business to attend to.
AAA!!!
"To the Monkey Island™ Cannibals:"
It's either an incisive representation of the futility of man...
Yes, it IS a nice view. Excuse me, I've got pressing business to
Whoops...
"Mr. Toothrot:"
Wow! Looked like it hit the big banana tree on the beach! I bet the
Rubber tree.
I would have knocked, but I couldn't find a door.
Excuse me, I've got pressing business to attend to.
I can paddle it with these oars.
There's a message in it! It's a memo...
"PRIVATE PROPERTY"
Yes, it's quite impressive.
Excuse me, I've got pressing business to attend to.
Hi! Seen any big, ugly, scary, see-through pirates around here?
Hi! Is there anything good to eat on this island?
Hi! I'm here to rescue the Governor of Mêlée Island™.
Hi! I think I'm going nuts. I've got to hurry up and rescue the
"Cannibals--"
You're cannibals?!
Look behind you! A three-headed monkey!
Look behind you! A three-headed monkey!
"To the ghost pirate LeChuck:"
I might fit through that hole, but I don't think this banana picker
I doubt anyone will miss this piece of junk.
This is much too heavy to pick up... let alone carry around this
Don't eat me! I'm a mighty pirate!
(approaches)
I have your banana picker. (gives the picker)
(receives the key) OK. And don't worry, I won't use it or anything.
Well, actually, there is something...
Money. I want money.
I need a ship.
Well, this big rock fell out of the sky...
I'm looking for somebody. 
I'm looking for 30 dead guys and one woman.
Then you've seen the ghost pirate LeChuck and his cadaverous crew?
Give me the potion! I'll use it on LeChuck!
Why not?
LeChuck came in here and stole your root? What a cad!
Where is he hiding it?
What happened? Health department shut you down?
I'm off to find LeChuck and get the root!
The what?
Why are you guys talking in pig Latin?
--ahem--
I know, but I really need that navigator head thing.
(receives the head) Thanks.
Yeah!
I had a feeling that in hell there would be mushrooms.
Uhh... You wouldn't happen to have a root I could borrow? Yikes!
Hello, head.
Thank you for leading me to the ghost ship.
May I please have that necklace?
Why can't I have it?
Why can't I have it?
Maybe I'll just take it...
I don't want to have to hurt you...
What're you going to do? Bite me?
If I wanted to I could dropkick you into the lava.
This feels weird.
Yikes! I hate rats!
Yech, it's all over my hands.
This should stop it from squeaking.
Oh good, more inventory.
This should do it...
I'll just grab this old root and be on my way.
I did it! I got the root! (hands the root)
I'd love to have you stuffed. I'd make a fortune.
Thanks.
What happened to the ship?
What wedding?
WHAT? But how will they... Where is the wedding?
Mêlée Island™? Oh, no! Why are YOU still here?
I've got to go after them! I've got to stop that wedding!!
...hey... How did you get in here without a head?
If you have a ship, why are you waiting to be rescued?
Will you take me to Mêlée Island™?
OK.
Well, that was certainly easier than the trip TO Monkey Island™.
Yikes!
I'm selling this fine mouthwash.
(squirts the magic liquid, beating the ghost completely) Cool!
I must have left it in my other pants. Bye now.
I suffer from a rare pigmentation efficiency syndrome.
My chains are at the cleaners being degreased.
It's busy being overpowered by your OWN deathly stench.
You mean the head on this root beer?
STOP THE WEDDING!!
Take THIS, you vaporous voodoo vermin!
Governor!
How did you manage to escape?
I thought LeChuck was going to marry you.
If you're here, then who's that in the dress?
What?
Oh, I'll get it!
...oops...
...but... ...I... ...er... ...hey... 
Well, I can't believe your stupidity.
Well, I can't believe your enormity.
Well, I can't believe your atrocity.
Well, I can't believe your alacrity.
...Er... ...say, now... ...let's not be hasty...
Yikes! Don't sneak up on me like that!
That's OK. You know, LeChuck was a deviant, obnoxious, slithery,
He sure looks nice exploding against the night sky.
Actually, I'm a bit sick of root beer. While I was in the machine
I wish me crew could have seen this...
At least I learned something from all of this...
How to deal with frustation, disappointment, and irritating
Yikes!